TOKEN = "5877350425:AAGYELr4LehhTfeMBuUVMBrGBB3gDkqXGF4"

currencies = {
    'доллар': ['USD', 'долларов', ('usd', 'долар', 'доллары', 'dollar', '$')],
    'евро': ['EUR', 'евро', ('eur', 'euros', 'eu')],
    'фунт': ['GBP', 'фунтов', ('фунты', 'gbp', 'pound', 'pounds')],
    'иена': ['JPY', 'иен', ('jpy', 'иены', 'yen', 'йена', 'йены')],
    'юань': ['CNY', 'юаней', ('cny', 'юани')],
    'рубль': ['RUB', 'рублей', ('рубли', 'rub', 'ruble')],
    'франк': ['CHF', 'швейцарских франков', ('chf', 'франки', 'frank')],
 }